RylanTu/Embodied-Perception-of-Drones/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_FREERTOS_HZ=1000
# CONFIG_DRONE_SENSOR_DEBUG_MODE is not set
CONFIG_DRONE_I2C_SDA_GPIO=1
CONFIG_DRONE_I2C_SCL_GPIO=2
CONFIG_DRONE_SAMPLE_RATE_HZ=200
CONFIG_DRONE_FILTER_KALMAN=y
CONFIG_DRONE_FILTER_KALMAN_Q_MILLI=30
CONFIG_DRONE_FILTER_KALMAN_R_MILLI=20
